coocox/Mplib/Toshaba/TMPM061/cmsis_lib/lib/cmsis_boot/TMPM061.h
/**
 *******************************************************************************
 * @file    TMPM061.h
 * @brief   CMSIS Cortex-M0 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM061' Device Series
 * @version V2.0.2.3 (Tentative)
 * @date    2013/03/05
 * 
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
 * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 * 
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 * 
 * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
 * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
 * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
 * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
 * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2013 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX00_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM061
  * @{
  */

#ifndef __TMPM061_H__
#define __TMPM061_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M0 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M0 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M0 Memory Management Interrupt                     */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M0 SV Call Interrupt                              */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M0 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M0 System Tick Interrupt                          */

/******  TMPM061 Specific Interrupt Numbers *******************************************************************/
  INTPCE_IRQn                   = 0,         /*!< PCE interface                                               */
  INTDSAD0_IRQn                 = 1,         /*!< ¦¤¦²A/D conversion complete interrupt (unit0)                 */
  INTDSAD1_IRQn                 = 2,         /*!< ¦¤¦²A/D conversion complete interrupt (unit1)                 */
  INTDSAD2_IRQn                 = 3,         /*!< ¦¤¦²A/D conversion complete interrupt (unit2)                 */
  INTLVD_IRQn                   = 4,         /*!< Voltage detector interrupt                                  */
  INT0_IRQn                     = 5,         /*!< Interrupt pin 0                                             */
  INT1_IRQn                     = 6,         /*!< Interrupt pin 1                                             */
  INT2_IRQn                     = 7,         /*!< Interrupt pin 2                                             */
  INT3_IRQn                     = 8,         /*!< Interrupt pin 3                                             */
  INTRX0_IRQn                   = 9,         /*!< Serial reception (channel.0)                                */
  INTTX0_IRQn                   = 10,        /*!< Serial transmission (channel.0)                             */
  INTRX1_IRQn                   = 11,        /*!< Serial reception (channel.1)                                */
  INTTX1_IRQn                   = 12,        /*!< Serial transmission (channel.1)                             */
  INTRX2_IRQn                   = 13,        /*!< Serial reception (channel.2)                                */
  INTTX2_IRQn                   = 14,        /*!< Serial transmission (channel.2)                             */
  INTRX3_IRQn                   = 15,        /*!< Serial reception (channel.3)                                */
  INTTX3_IRQn                   = 16,        /*!< Serial transmission (channel.3)                             */
  INTSBI_IRQn                   = 17,        /*!< Serial bus interface                                        */
  INTTB0_IRQn                   = 18,        /*!< 16-bit TMRB match detection 0                               */
  INTTB1_IRQn                   = 19,        /*!< 16-bit TMRB match detection 1                               */
  INTCAP00_IRQn                 = 20,        /*!< 16-bit TMRB input capture 0 (channel.0)                     */
  INTCAP01_IRQn                 = 21,        /*!< 16-bit TMRB input capture 1 (channel.0)                     */
  INTCAP10_IRQn                 = 22,        /*!< 16-bit TMRB input capture 0 (channel.1)                     */
  INTCAP11_IRQn                 = 23,        /*!< 16-bit TMRB input capture 1 (channel.1)                     */
  INTT16A0_IRQn                 = 24,        /*!< 16-bit TMR16A match detection (channel.0)                   */
  INTT16A1_IRQn                 = 25,        /*!< 16-bit TMR16A match detection (channel.1)                   */
  INTT16A2_IRQn                 = 26,        /*!< 16-bit TMR16A match detection (channel.2)                   */
  INTT16A3_IRQn                 = 27,        /*!< 16-bit TMR16A match detection (channel.3)                   */
  INTT16A5_IRQn                 = 28,        /*!< 16-bit TMR16A match detection (channel.5)                   */
  INTT16A6_IRQn                 = 29,        /*!< 16-bit TMR16A match detection (channel.6)                   */
  INTRTC_IRQn                   = 30,        /*!< Real time clock                                             */
  INTAD_IRQn                    = 31         /*!< A/D conversion completion interrupt                         */
} IRQn_Type;

