coocox/Mplib/Toshaba/TMPM061/cmsis_lib/lib/cmsis_boot/TMPM061.h
/* 16-bit Delta Sigma AD Converter (DSAD) */
#define TSB_DSAD0_CR1_MODEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD0->CR1,0)))
#define TSB_DSAD0_CR1_BIASEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD0->CR1,1)))
#define TSB_DSAD0_CR2_ADS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_DSAD0->CR2,0)))
#define TSB_DSAD0_CR3_REPEAT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD0->CR3,0)))
#define TSB_DSAD0_CR3_ADSYNC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD0->CR3,8)))
#define TSB_DSAD0_ADJ_ADJ                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD0->ADJ,0)))
#define TSB_DSAD0_ST_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD0->ST,0)))
#define TSB_DSAD0_ST_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD0->ST,1)))
#define TSB_DSAD0_RES_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD0->RES,0)))
#define TSB_DSAD0_RES_ADOVR                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD0->RES,1)))

#define TSB_DSAD1_CR1_MODEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD1->CR1,0)))
#define TSB_DSAD1_CR1_BIASEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD1->CR1,1)))
#define TSB_DSAD1_CR2_ADS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_DSAD1->CR2,0)))
#define TSB_DSAD1_CR3_REPEAT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD1->CR3,0)))
#define TSB_DSAD1_CR3_ADSYNC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD1->CR3,8)))
#define TSB_DSAD1_ADJ_ADJ                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD1->ADJ,0)))
#define TSB_DSAD1_ST_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD1->ST,0)))
#define TSB_DSAD1_ST_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD1->ST,1)))
#define TSB_DSAD1_RES_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD1->RES,0)))
#define TSB_DSAD1_RES_ADOVR                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD1->RES,1)))

#define TSB_DSAD2_CR1_MODEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD2->CR1,0)))
#define TSB_DSAD2_CR1_BIASEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD2->CR1,1)))
#define TSB_DSAD2_CR2_ADS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_DSAD2->CR2,0)))
#define TSB_DSAD2_CR3_REPEAT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD2->CR3,0)))
#define TSB_DSAD2_CR3_ADSYNC                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD2->CR3,8)))
#define TSB_DSAD2_ADJ_ADJ                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_DSAD2->ADJ,0)))
#define TSB_DSAD2_ST_ADBF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD2->ST,0)))
#define TSB_DSAD2_ST_EOCF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD2->ST,1)))
#define TSB_DSAD2_RES_ADRF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD2->RES,0)))
#define TSB_DSAD2_RES_ADOVR                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_DSAD2->RES,1)))


/* Temperature Sensor (TEMP) */
#define TSB_TEMP_EN_EN0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TEMP->EN,0)))
#define TSB_TEMP_EN_EN1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TEMP->EN,1)))
#define TSB_TEMP_CR_CR0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_TEMP->CR,0)))


/* Low Voltage detector control register */
#define TSB_LVD_ICR_LVDEN2                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->ICR,0)))
#define TSB_LVD_ICR_INTSEL                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->ICR,4)))
#define TSB_LVD_ICR_LVDINTEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->ICR,5)))
#define TSB_LVD_SR_LVDST2                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_LVD->SR,1)))


/* Real Time Clock (RTC) */
#define TSB_RTC_ADJCTL_AJEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_RTC->ADJCTL,0)))


/* LCD Driver (LCD) */
#define TSB_LCD_EN_LCDE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_LCD->EN,0)))
#define TSB_LCD_CR1_EDSP                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_LCD->CR1,7)))
#define TSB_LCD_CR2_BRSEL                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_LCD->CR2,3)))
#define TSB_LCD_CR2_BRH                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_LCD->CR2,4)))


/* Flash Control (FC) */
#define TSB_FC_SECBIT_SECBIT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_FC->SECBIT,0)))
#define TSB_FC_FLCS_RDY_BSY                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->FLCS,0)))
#define TSB_FC_DBGEN_EN0                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->DBGEN,0)))
#define TSB_FC_DBGEN_EN1                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_FC->DBGEN,1)))


/* Clock Generator (CG) */
#define TSB_CG_SYSCR_FCSTOP                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,20)))
#define TSB_CG_OSCCR_WUEON                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,0)))
#define TSB_CG_OSCCR_WUEF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,1)))
#define TSB_CG_OSCCR_WUPSEL1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,3)))
#define TSB_CG_OSCCR_XEN1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,8)))
#define TSB_CG_OSCCR_XTEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,9)))
#define TSB_CG_OSCCR_LOSCSEL                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,10)))
#define TSB_CG_OSCCR_EHCLKEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,11)))
#define TSB_CG_OSCCR_XEN2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,16)))
#define TSB_CG_OSCCR_OSCSEL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,17)))
#define TSB_CG_OSCCR_HOSCON                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,18)))
#define TSB_CG_OSCCR_WUPSEL2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,19)))
#define TSB_CG_STBYCR_RXEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,8)))
#define TSB_CG_STBYCR_RXTEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,9)))
#define TSB_CG_STBYCR_DRVE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,16)))
#define TSB_CG_EHCLKSEL_EHCLKSEL                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->EHCLKSEL,0)))
#define TSB_CG_CKSEL_SYSCKFLG                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_CG->CKSEL,0)))
#define TSB_CG_CKSEL_SYSCK                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->CKSEL,1)))
#define TSB_CG_RSTFLG_PINRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,0)))
#define TSB_CG_RSTFLG_WDTRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,2)))
#define TSB_CG_RSTFLG_DBGRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,4)))
#define TSB_CG_IMCGA_INT0EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,0)))
#define TSB_CG_IMCGA_INT1EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,8)))
#define TSB_CG_IMCGA_INT2EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,16)))
#define TSB_CG_IMCGA_INT3EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,24)))
#define TSB_CG_IMCGB_INT4EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,0)))
#define TSB_CG_IMCGB_INT5EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,8)))

/** @} */ /* End of group Device_Peripheral_registers */

#ifdef __cplusplus
}
#endif

#endif  /* __TMPM061_H__ */

/** @} */ /* End of group TMPM061 */
/** @} */ /* End of group TOSHIBA_TX00_MICROCONTROLLER */
